In [25]:
import pandas as pd
import yfinance
#https://www.cdslindia.com/Publications/FIIFPIYrWiseInvstmntDtls.aspx

In [58]:
nifty_m1 = yfinance.download(tickers="^NSEI",interval='1mo',start="2002-01-01", 
                             group_by = 'ticker', auto_adjust = True)

[*********************100%***********************]  1 of 1 completed

In [23]:
fii_df = pd.read_csv("../stock_historical_data/fii/nifty.csv")
fii_df.drop("Unnamed: 0",axis=1,inplace=True)

In [47]:
fii_df.head()

         date  equity
0  2002-01-01   423.3
1  2002-02-01  1966.3
2  2002-03-01   391.4
3  2002-04-01    11.7
4  2002-05-01   -56.0

In [59]:
nifty_m1["date"] = nifty_m1.index

In [104]:

final_df =[]
for i in range(0,len(nifty_m1)-1):
    if 1 == 1:
        tempResult = {}
        currentTym = nifty_m1.iloc[i].date.strftime("%Y-%m-%d")
       # print(currentTym)
        if nifty_m1.iloc[i].Close < nifty_m1.iloc[i+1].Close:
            tempResult['label'] = 1
        else:
            tempResult['label'] = 0
        #print("label current",label,"coming month",labelT1)
        fii_info = fii_df[fii_df['date'] == currentTym]
        tempResult['equity'] = fii_info.equity.values[0]
        tempResult['date'] = fii_info.date.values[0]
        final_df.append(tempResult)

final_df = pd.DataFrame(final_df)

     label    equity        date
0        0  20590.90  2007-10-01
1        1  -5849.90  2007-11-01
2        0   5579.10  2007-12-01
3        1 -13035.70  2008-01-01
4        0   1733.30  2008-02-01
..     ...       ...         ...
185      1   7935.63  2023-03-01
186      1  11630.82  2023-04-01
187      1  43838.11  2023-05-01
188      1  47148.34  2023-06-01
189      0  46617.76  2023-07-01

[190 rows x 3 columns]